tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
brew "curl"
brew "gh"
brew "git"
brew "grip"
brew "jq"
brew "n"
brew "node", link: false
brew "pnpm"
brew "putty"
brew "ssh-copy-id"
brew "tree"
brew "typescript"
brew "wget"
brew "yarn"
brew "zsh-autocomplete"
cask "amazon-q"
cask "appcleaner"
cask "bitwarden", args: { appdir: "/Applications" }
cask "docker"
cask "figma"
cask "firefox", args: { appdir: "/Applications" }
cask "font-ricty-diminished", args: { appdir: "/Applications" }
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "notion"
cask "notion-calendar"
cask "raycast", args: { appdir: "/Applications" }
cask "slack"
cask "transmit", args: { appdir: "/Applications" }
cask "visual-studio-code"
cask "zoom", args: { appdir: "/Applications" }
vscode "1natsu.insert-br-tag"
vscode "actboy168.tasks"
vscode "alefragnani.project-manager"
vscode "astro-build.astro-vscode"
vscode "aswinkumar863.smarty-template-support"
vscode "austenc.tailwind-docs"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "brapifra.phpserver"
vscode "burkeholland.simple-react-snippets"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "davidbabel.vscode-simpler-icons"
vscode "dbaeumer.vscode-eslint"
vscode "devescalus.svg-sprites-viewer"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "gonishiduka1985.extractioncssselector"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hookyqr.minify"
vscode "htmlhint.vscode-htmlhint"
vscode "irongeek.vscode-env"
vscode "jack89ita.copy-filename"
vscode "junstyle.php-cs-fixer"
vscode "kenhowardpdx.vscode-gist"
vscode "lightyen.tailwindcss-intellisense-twin"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mohd-akram.vscode-html-format"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mosapride.zenkaku"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode.makefile-tools"
vscode "neilbrayfield.php-docblocker"
vscode "nucllear.vscode-extension-auto-import"
vscode "oliversturm.fix-json"
vscode "onecentlin.laravel-blade"
vscode "paulmolluzzo.convert-css-in-js"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pranaygp.vscode-css-peek"
vscode "raczzalan.webgl-glsl-editor"
vscode "raidou.calc"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "ryu1kn.partial-diff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "smelukov.vscode-csstree"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.vscode-input-sequence"
vscode "unifiedjs.vscode-mdx"
vscode "v4run.transpose"
vscode "whizkydee.material-palenight-theme"
vscode "xdebug.php-debug"
vscode "yutengjing.open-in-external-app"
vscode "zh9528.file-size"
