cask_args appdir: "/Applications"

tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "node"
brew "curl"
brew "gh"
brew "git"
brew "grip"
brew "jq"
brew "n"
brew "ssh-copy-id"
brew "tree"
brew "wget"
brew "yarn"

cask "adobe-creative-cloud"
cask "appcleaner"
cask "bitwarden"
cask "fig"
cask "figma"
cask "firefox"
cask "font-ricty-diminished"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "notion"
cask "raycast"
cask "transmit"
cask "visual-studio-code"
cask "zoom"

vscode "1natsu.insert-br-tag"
vscode "actboy168.tasks"
vscode "alefragnani.project-manager"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "cssho.vscode-svgviewer"
vscode "csstools.postcss"
vscode "davidbabel.vscode-simpler-icons"
vscode "dbaeumer.vscode-eslint"
vscode "devescalus.svg-sprites-viewer"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "irongeek.vscode-env"
vscode "jack89ita.copy-filename"
vscode "kenhowardpdx.vscode-gist"
vscode "kiteco.kite"
vscode "lightyen.tailwindcss-intellisense-twin"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode.makefile-tools"
vscode "nucllear.vscode-extension-auto-import"
vscode "oliversturm.fix-json"
vscode "paulmolluzzo.convert-css-in-js"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "raidou.calc"
vscode "richie5um2.vscode-sort-json"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "tomoki1207.vscode-input-sequence"
vscode "unifiedjs.vscode-mdx"
vscode "v4run.transpose"
vscode "whizkydee.material-palenight-theme"
vscode "withfig.fig"
vscode "xdebug.php-debug"
vscode "yutengjing.open-in-external-app"
vscode "zh9528.file-size"
